import {Injectable} from '@angular/core';

@Injectable()
export class TodoService {

  private _todoList = [
    { text: 'من را بررسی کنید' },
    { text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و' },
    { text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت' },
    { text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده.' },
    { text: 'لورم ایپسوم متن ساختگی با' },
    { text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک' },
    { text: 'تماس با تیم hdev' },
    { text: 'ارسال ایمیل به تیم تجاری سایت' },
    { text: 'آیا از این سیستم راضی هستید ' },
    { text: 'به چه چیزی فکر میکنید ؟' },
  ];

  getTodoList() {
    return this._todoList;
  }
}
